; domain
(define (domain monkey-and-bananas)
    (:requirements :strips :typing :negative-preconditions)

    (:types
        monkey - object
        crate - object
        bananas - object
        position
    )

    (:predicates
        (at ?o - object ?p - position)
        (nextTo ?p1 - position ?p2 - position)
        (straightTriple ?p1 - position ?p2 - position ?p3 - position)
        (empty ?p - position)
        (movable ?c - crate)
        (up ?m - monkey)
        (grabbed ?b - bananas)
    )

    (:action move
        :parameters (?m - monkey ?pFrom - position ?pTo - position)
        :precondition (and
            (not (up ?m))
            (at ?m ?pFrom)
            (empty ?pTo)
            (nextTo ?pFrom ?pTo)
        )
        :effect (and
            (empty ?pFrom)
            (not (empty ?pTo))
            (not (at ?m ?pFrom))
            (at ?m ?pTo)
        )
    )

    (:action pull
        :parameters (?m - monkey ?c - crate ?mPos - position ?cPos - position ?toPos - position)
        :precondition (and
            (movable ?c)
            (not (up ?m))
            (at ?m ?mPos)
            (at ?c ?cPos)
            (nextTo ?mPos ?cPos)
            (nextTo ?mPos ?toPos)
            (straightTriple ?cPos ?mPos ?toPos)
            (empty ?toPos)
        )
        :effect (and
            (not (at ?m ?mPos))
            (at ?m ?toPos)
            (not (at ?c ?cPos))
            (at ?c ?mPos)
            (empty ?cPos)
            (not (empty ?toPos))
        )
    )

    (:action push
        :parameters (?m - monkey ?c - crate ?mPos - position ?cPos - position ?toPos - position)
        :precondition (and
            (movable ?c)
            (not (up ?m))
            (at ?m ?mPos)
            (at ?c ?cPos)
            (nextTo ?mPos ?cPos)
            (nextTo ?cPos ?toPos)
            (straightTriple ?mPos ?cPos ?toPos)
            (empty ?toPos)
        )
        :effect (and
            (not (at ?m ?mPos))
            (at ?m ?cPos)
            (not (at ?c ?cPos))
            (at ?c ?toPos)
            (empty ?mPos)
            (not (empty ?toPos))
        )
    )

    (:action climb
        :parameters (?m - monkey ?c - crate ?mPos - position ?cPos - position)
        :precondition (and
            (at ?m ?mPos)
            (at ?c ?cPos)
            (nextTo ?mPos ?cPos)
        )
        :effect (and
            (not (movable ?c))
            (empty ?mPos)
            (not (at ?m ?mPos))
            (at ?m ?cPos)
            (up ?m)
        )
    )

    (:action grab
        :parameters (?m - monkey ?b - bananas ?pos - position)
        :precondition (and
            (at ?m ?pos)
            (at ?b ?pos)
            (up ?m)
            (not (grabbed ?b))
        )
        :effect (and
            (grabbed ?b)
        )
    )
)

; problem
(define (problem sample-problem)
	(:domain monkey-and-bananas)

	(:objects
		monkey-1 monkey-2 - monkey
		crate-1 crate-2 - crate
		bananas-1 bananas-2 - bananas
		position-11 position-12 position-13 position-14 position-15
		position-21 position-22 position-23 position-24 position-25
		position-31 position-32 position-33 position-34 position-35
		position-41 position-42 position-43 position-44 position-45
		position-51 position-52 position-53 position-54 position-55 - position
	)

	(:init
		; monkeys
		(not (up monkey-1))
		(at monkey-1 position-24)

		(not (up monkey-2))
		(at monkey-2 position-52)

		; bananas
		(not (grabbed bananas-1))
		(at bananas-1 position-12)

		(not (grabbed bananas-2))
		(at bananas-2 position-42)

		; crates
		(movable crate-1)
		(at crate-1 position-23)

		(movable crate-2)
		(at crate-2 position-54)

		; empty
		(empty position-11)
		(empty position-12)
		(empty position-13)
		(empty position-14)
		(empty position-15)

		(empty position-21)
		(empty position-22)
		;(empty position-23)
		;(empty position-24)
		(empty position-25)

		(empty position-31)
		(empty position-32)
		(empty position-33)
		(empty position-34)
		(empty position-35)

		(empty position-41)
		(empty position-42)
		(empty position-43)
		(empty position-44)
		(empty position-45)

		(empty position-51)
		;(empty position-52)
		(empty position-53)
		;(empty position-54)
		(empty position-55)

		; nextTo
		(nextTo position-11 position-12)
		(nextTo position-11 position-21)
		(nextTo position-12 position-11)
		(nextTo position-12 position-13)
		(nextTo position-12 position-22)
		(nextTo position-13 position-12)
		(nextTo position-13 position-14)
		(nextTo position-13 position-23)
		(nextTo position-14 position-13)
		(nextTo position-14 position-15)
		(nextTo position-14 position-24)
		(nextTo position-15 position-14)
		(nextTo position-15 position-25)

		(nextTo position-21 position-11)
		(nextTo position-21 position-22)
		(nextTo position-21 position-31)
		(nextTo position-22 position-12)
		(nextTo position-22 position-21)
		(nextTo position-22 position-23)
		(nextTo position-22 position-32)
		(nextTo position-23 position-13)
		(nextTo position-23 position-22)
		(nextTo position-23 position-24)
		(nextTo position-23 position-33)
		(nextTo position-24 position-14)
		(nextTo position-24 position-23)
		(nextTo position-24 position-25)
		(nextTo position-24 position-34)
		(nextTo position-25 position-15)
		(nextTo position-25 position-24)
		(nextTo position-25 position-35)
		(nextTo position-31 position-21)

		(nextTo position-31 position-32)
		(nextTo position-31 position-41)
		(nextTo position-32 position-22)
		(nextTo position-32 position-31)
		(nextTo position-32 position-33)
		(nextTo position-32 position-42)
		(nextTo position-33 position-23)
		(nextTo position-33 position-32)
		(nextTo position-33 position-34)
		(nextTo position-33 position-43)
		(nextTo position-34 position-24)
		(nextTo position-34 position-33)
		(nextTo position-34 position-35)
		(nextTo position-34 position-44)
		(nextTo position-35 position-25)
		(nextTo position-35 position-34)
		(nextTo position-35 position-45)

		(nextTo position-41 position-31)
		(nextTo position-41 position-42)
		(nextTo position-41 position-51)
		(nextTo position-42 position-32)
		(nextTo position-42 position-41)
		(nextTo position-42 position-43)
		(nextTo position-42 position-52)
		(nextTo position-43 position-33)
		(nextTo position-43 position-42)
		(nextTo position-43 position-44)
		(nextTo position-43 position-53)
		(nextTo position-44 position-34)
		(nextTo position-44 position-43)
		(nextTo position-44 position-45)
		(nextTo position-44 position-54)
		(nextTo position-45 position-35)
		(nextTo position-45 position-44)
		(nextTo position-45 position-55)

		(nextTo position-51 position-41)
		(nextTo position-51 position-52)
		(nextTo position-52 position-42)
		(nextTo position-52 position-51)
		(nextTo position-52 position-53)
		(nextTo position-53 position-43)
		(nextTo position-53 position-52)
		(nextTo position-53 position-54)
		(nextTo position-54 position-44)
		(nextTo position-54 position-53)
		(nextTo position-54 position-55)
		(nextTo position-55 position-45)
		(nextTo position-55 position-54)

		; straightTriple
		(straightTriple position-11 position-21 position-31)
		(straightTriple position-11 position-12 position-13)
		(straightTriple position-12 position-22 position-32)
		(straightTriple position-12 position-13 position-14)
		(straightTriple position-13 position-23 position-33)
		(straightTriple position-13 position-14 position-15)
		(straightTriple position-13 position-12 position-11)
		(straightTriple position-14 position-24 position-34)
		(straightTriple position-14 position-13 position-12)
		(straightTriple position-15 position-25 position-35)
		(straightTriple position-15 position-14 position-13)
		(straightTriple position-21 position-31 position-41)
		(straightTriple position-21 position-22 position-23)
		(straightTriple position-22 position-32 position-42)
		(straightTriple position-22 position-23 position-24)
		(straightTriple position-23 position-33 position-43)
		(straightTriple position-23 position-24 position-25)
		(straightTriple position-23 position-22 position-21)
		(straightTriple position-24 position-34 position-44)
		(straightTriple position-24 position-23 position-22)
		(straightTriple position-25 position-35 position-45)
		(straightTriple position-25 position-24 position-23)
		(straightTriple position-31 position-41 position-51)
		(straightTriple position-31 position-21 position-11)
		(straightTriple position-31 position-32 position-33)
		(straightTriple position-32 position-42 position-52)
		(straightTriple position-32 position-22 position-12)
		(straightTriple position-32 position-33 position-34)
		(straightTriple position-33 position-43 position-53)
		(straightTriple position-33 position-23 position-13)
		(straightTriple position-33 position-34 position-35)
		(straightTriple position-33 position-32 position-31)
		(straightTriple position-34 position-44 position-54)
		(straightTriple position-34 position-24 position-14)
		(straightTriple position-34 position-33 position-32)
		(straightTriple position-35 position-45 position-55)
		(straightTriple position-35 position-25 position-15)
		(straightTriple position-35 position-34 position-33)
		(straightTriple position-41 position-31 position-21)
		(straightTriple position-41 position-42 position-43)
		(straightTriple position-42 position-32 position-22)
		(straightTriple position-42 position-43 position-44)
		(straightTriple position-43 position-33 position-23)
		(straightTriple position-43 position-44 position-45)
		(straightTriple position-43 position-42 position-41)
		(straightTriple position-44 position-34 position-24)
		(straightTriple position-44 position-43 position-42)
		(straightTriple position-45 position-35 position-25)
		(straightTriple position-45 position-44 position-43)
		(straightTriple position-51 position-41 position-31)
		(straightTriple position-51 position-52 position-53)
		(straightTriple position-52 position-42 position-32)
		(straightTriple position-52 position-53 position-54)
		(straightTriple position-53 position-43 position-33)
		(straightTriple position-53 position-54 position-55)
		(straightTriple position-53 position-52 position-51)
		(straightTriple position-54 position-44 position-34)
		(straightTriple position-54 position-53 position-52)
		(straightTriple position-55 position-45 position-35)
		(straightTriple position-55 position-54 position-53)
	)
	
	(:goal (and
		(grabbed bananas-1)
		(grabbed bananas-2)
	))
)

; plan
1. (move monkey-2 position-52 position-53)
   deleted: (empty position-53) (at monkey-2 position-52)
   added: (empty position-52) (at monkey-2 position-53)
   goals met: 0 of 2
2. (pull monkey-2 crate-2 position-53 position-54 position-52)
   deleted: (at monkey-2 position-53) (at crate-2 position-54) (empty position-52)
   added: (at monkey-2 position-52) (at crate-2 position-53) (empty position-54)
   goals met: 0 of 2
3. (pull monkey-2 crate-2 position-52 position-53 position-51)
   deleted: (at monkey-2 position-52) (at crate-2 position-53) (empty position-51)
   added: (at monkey-2 position-51) (at crate-2 position-52) (empty position-53)
   goals met: 0 of 2
4. (move monkey-2 position-51 position-41)
   deleted: (empty position-41) (at monkey-2 position-51)
   added: (empty position-51) (at monkey-2 position-41)
   goals met: 0 of 2
5. (move monkey-2 position-41 position-42)
   deleted: (empty position-42) (at monkey-2 position-41)
   added: (empty position-41) (at monkey-2 position-42)
   goals met: 0 of 2
6. (pull monkey-2 crate-2 position-42 position-52 position-32)
   deleted: (at monkey-2 position-42) (at crate-2 position-52) (empty position-32)
   added: (at monkey-2 position-32) (at crate-2 position-42) (empty position-52)
   goals met: 0 of 2
7. (push monkey-1 crate-1 position-24 position-23 position-22)
   deleted: (at monkey-1 position-24) (at crate-1 position-23) (empty position-22)
   added: (at monkey-1 position-23) (at crate-1 position-22) (empty position-24)
   goals met: 0 of 2
8. (push monkey-2 crate-1 position-32 position-22 position-12)
   deleted: (at monkey-2 position-32) (at crate-1 position-22) (empty position-12)
   added: (at monkey-2 position-22) (at crate-1 position-12) (empty position-32)
   goals met: 0 of 2
9. (move monkey-2 position-22 position-32)
   deleted: (empty position-32) (at monkey-2 position-22)
   added: (empty position-22) (at monkey-2 position-32)
   goals met: 0 of 2
10. (climb monkey-2 crate-2 position-32 position-42)
   deleted: (movable crate-2) (at monkey-2 position-32)
   added: (empty position-32) (at monkey-2 position-42) (up monkey-2)
   goals met: 0 of 2
11. (grab monkey-2 bananas-2 position-42)
   added: (grabbed bananas-2)
   goals met: 1 of 2
12. (move monkey-1 position-23 position-22)
   deleted: (empty position-22) (at monkey-1 position-23)
   added: (empty position-23) (at monkey-1 position-22)
   goals met: 1 of 2
13. (climb monkey-1 crate-1 position-22 position-12)
   deleted: (movable crate-1) (at monkey-1 position-22)
   added: (empty position-22) (at monkey-1 position-12) (up monkey-1)
   goals met: 1 of 2
14. (grab monkey-1 bananas-1 position-12)
   added: (grabbed bananas-1)
   goals met: 2 of 2
